01  WS-AREA-1 PIC X(100). 01 WS-AREA-2 PIC 9(5) VALUE 0. MOVE 'some data' TO WS-AREA-1. ADD 1 TO WS-AREA-2. If WS-AREA-2 > 10 then PERFORM some-routine END-IF. 